server/stress-tests/tagaz-get-stress-test.yml
config:
  target: "http://127.0.0.1:3001"
  phases:
    - duration: 5
      arrivalRate: 1
      name: Start
      - duration: 20
      arrivalRate: 10
      name: Warm up
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Ramp up to 100
      - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: Ramp up to 1000
    - duration: 60
      arrivalRate: 1000
      name: Sustained load at 1000
scenarios:
  # We define one scenario:
  - name: "Get restaurant data"
    flow:
      # Get the details of the product:
      - get:
          url: "/restaurant/{{ $randomNumber(9000000, 10000000) }}"